[
  {
    "id": 92478355,
    "title": "iPhone 13",
    "price": 1000,
    "rating": 4.69,
    "category": "smartphones",
    "thumbnail": "https://estore.ua/ua/media/catalog/product/cache/9/image/600x600/9df78eab33525d08d6e5fb8d27136e95/i/p/iphone-13-midnight-select-2021_1.png",
    "color": "Midnight",
    "description": "Рамки з алюмінію (у 13 Pro і 13 Pro Max зі сталі). На відміну від старших моделей тут немає сканера LiDAR, частота дисплея 60 Гц, менша максимальна яскравість (800 ніт проти 1000 ніт), стабілізація камери тільки матрична (немає оптичної). GPU 4 ядра."
  },
  {
    "id": 11884324,
    "title": "iPhone X",
    "price": 999,
    "rating": 4.44,
    "category": "smartphones",
    "thumbnail": "https://fedox.com.ua/content/images/48/480x480l50nn0/p1400557124-apple-iphone-256gb.html-99856543579055.png",
    "color": "Space Gray",
    "description": "Ювілейне покоління iPhone увібрало в себе більше інноваційних рішень, ніж кілька попередніх поколінь «яблучного» смартфона разом узятих. Судіть самі, лицьова панель «десятки» виконана у безрамковому дизайні, завдяки чому OLED-екран моделі розтягнувся по діагоналі на відстань 5.8 дюйма при не самих велетенських габаритах пристрою. Замість системи ідентифікації Touch ID смартфон обзавівся прогресивним способом аутентифікації власника по обличчю (Face ID)."
  },
  {
    "id": 22501939,
    "title": "Samsung Galaxy S22",
    "price": 850,
    "rating": 4.59,
    "category": "smartphones",
    "thumbnail": "https://welectronics.com/images/stories/virtuemart/product/SasmsungGalaxyS22pink34.jpg",
    "color": "Pink Gold",
    "description": "Глобальна версія побудована на процесорі Samsung Exynos 2200, для ринку Китаю, США й Індії – на Qualcomm Snapdragon 8 Gen 1. Розрахований на 2 SIM-карти формату nano й 1 SIM-карту формату e-SIM. Підтримка UWB (бездротового зв'язку на надшироких смугах)."
  },
  {
    "id": 47252896,
    "title": "Huawei Mate X2",
    "price": 2800,
    "rating": 4.3,
    "category": "smartphones",
    "thumbnail": "https://www.notebookcheck-ru.com/typo3temp/_processed_/b/7/csm_HuaweiMateX2_1__6c374f9dc7.jpg",
    "color": "Crystal Blue",
    "description": "Новий доладний смартфон з гнучким екраном постав на суд користувача цієї зими.  У цьому огляді ми познайомимо вас із усіма особливостями Huawei Mаte X2 і допоможемо визначитися: чи варто купити цю новинку. Невеликий спойлер: навіть незважаючи на те, що «недорогим» цього красеня назвати складно, він безперечно коштує своєї ціни."
  },
  {
    "id": 79773662,
    "title": "Amogus",
    "price": 304,
    "rating": 4.09,
    "category": "smartphones",
    "thumbnail": "https://static.wikia.nocookie.net/among-us/images/6/6a/Rednew.png/revision/latest/scale-to-width-down/250?cb=20210616054139&path-prefix=ru",
    "color": "Polar White",
    "description": "Амогус (Amogus) – спотворена назва гри Among Us, яка стала постіроничним трендом у 2021 році. Також амогусом називають спрощений малюнок персонажа цієї гри – космічного чоловічка."
  },
  {
    "id": 13096716,
    "title": "MacBook Pro 14”",
    "price": 1999,
    "rating": 4.57,
    "category": "laptops",
    "thumbnail": "https://ilounge.ua/files/products/apple-macbook-pro-14-m1-pro-01_1.1000x.jpg",
    "color": "Space Gray",
    "description": "З усіх актуальних ноутбуків Apple новий MacBook Pro 14″ демонструє оптимальне поєднання ціни, зручності та продуктивності. Так, у ряді тестів він поступився флагманському MacBook Pro 16 (хоча далеко не у всіх), але у того і ціна істотно вища, і корпус менш мобільний. У свою чергу, MacBook Pro 13″ на базі Apple M1 більш енергоефективний, але за продуктивністю він суттєво слабший, а відсутність HDMI-виходу та слота для карт пам'яті робить його менш зручним для професійного використання (наприклад, якщо ви фотограф або часто виступаєте з презентаціями))."
  },
  {
    "id": 95136197,
    "title": "Samsung Galaxy Book Pro",
    "price": 930,
    "rating": 4.25,
    "category": "laptops",
    "thumbnail": "https://i4.price.ua/images/offers/50891/type3/2801285651.jpg",
    "color": "Mystic Silver",
    "description": "AMOLED у корпусі вагою 1.1 кіло. Свіжий преміум-ноутбук Samsung виграє кілька сотень грам ваги у Dell XPS 15, HP Spectre x360 15 та всіх інших популярних 15-дюймових варіантів. Виявимо, чи далося взнаки таке досягнення на продуктивності та часу роботи."
  },
  {
    "id": 55836825,
    "title": "Microsoft Surface Laptop 4",
    "price": 800,
    "rating": 4.43,
    "category": "laptops",
    "thumbnail": "https://hotline.ua/img/tx/307/3079026555.jpg",
    "color": "Matte Black",
    "description": "Четверте покоління ультрабуків лінійки Surface Laptop компанії Microsoft об'єднує ноутбуки з сенсорним 13.5-дюймовим екраном, легким алюмінієвим корпусом (менше 1.3 кг) і тонким профілем (товщина 15 мм). Представники сімейства здатні вирішувати широкий спектр повсякденних завдань, включаючи роботу з офісними додатками, організацію відеоконференцій (є веб-камера і якісні динаміки Dolby Atmos), підготовку студентських робіт, перегляд серіалів і т.д. компактність дозволяє без проблем брати лептоп з собою на навчання або роботу, а тривалий запас автономності (до 17 годин) з можливістю живлення через USB C — не переживати про необхідність перебувати поблизу від розетки. Ноутбуки Microsoft Surface Laptop 4 13.5 inch отримали фірмовий дисплей PixelSense з сенсорним управлінням і датчиком освітлення, коригуючим картинку з урахуванням зовнішніх умов. Зображення характеризується високою деталізацією (роздільна здатність 2256x1504 пікселів), гідною яскравістю (400 кд/м2) і передачею кольору. В рамках лінійки пропонується великий вибір конфігурації з різною «начинкою». У ролі апаратної платформи може виступати як AMD Ryzen 5 C інтегрованою відеокартою Vega 6, так і Intel Core C Iris Xe Graphics G7. Об'єм оперативної пам'яті варіюється від 8 до 16 ГБ, а ємність твердотільних накопичувачів SSD M. 2 — від 256 до 512 ГБ. До загальних рис всіх лептопів відноситься наявність модуля бездротового зв'язку Wi-Fi 6, сканера обличчя FaceID, підсвічування клавіатури, а також передвстановленою ОС Windows."
  },
  {
    "id": 25835223,
    "title": "Asus Zenbook 14X",
    "price": 1362,
    "rating": 4.54,
    "category": "laptops",
    "thumbnail": "https://i.citrus.world/imgcache/size_800/uploads/shop/1/2/1200e5f7a92e27ddb6e536916bbb0f56.jpg",
    "color": "Pine Grey",
    "description": "Додайте яскравих фарб усьому, що ви робите, за допомогою Zenbook 14X OLED – витонченого, легкого, компактного ноутбука, у конфігурацію якого входять новітній процесор Intel. Серед його переваг – OLED-дисплей із тонкою рамкою, опціональним сенсорним інтерфейсом і чудовими характеристиками (роздільна здатність до 4K, технологія HDR, співвідношення сторін 16:10), який розкривається на 180"
  },
  {
    "id": 65789471,
    "title": "MSI Creator 15",
    "price": 1849,
    "rating": 4.43,
    "category": "laptops",
    "thumbnail": "https://hotline.ua/img/tx/339/3395943685.jpg",
    "color": "Core Black",
    "description": "MSI Creator 15 розроблений для творців контенту, але знадобиться і геймеру. Відеокарта Nvidia RTX і два SSD у масиві RAID забезпечать достатньо потужності та місткості для всіх завдань. В одну упряжку з ними поставлено 16 гігабайт RAM і Core i7-10875H. Про плюси та мінуси того, що вийшло в сумі, розповімо далі."
  },
  {
    "id": 52734471,
    "title": "Hator Hellraizer",
    "price": 1299,
    "rating": 4.2,
    "category": "headphones",
    "thumbnail": "https://content2.rozetka.com.ua/goods/images/big/35779108.jpg",
    "color": "Black",
    "description": "Універсальні геймерські накладні навушники закритого типу з дротовим підключенням, знімним мікрофоном на гнучкій дужці і одностороннім підведенням кабелю. Позиціонуються як доступна багатофункціональна ігрова гарнітура середньої цінової категорії, що підходить для самого широкого кола любителів геймінгу на будь-яких популярних платформах. Обладнана потужними 50 мм динамічними драйверами з неодимовими магнітами і композитною мембраною."
  },
  {
    "id": 42285462,
    "title": "Shanling M3X",
    "price": 15549,
    "rating": 4.72,
    "category": "audio-player",
    "thumbnail": "https://mzimg.com/big/c1/gsauly4occ1.jpg",
    "color": "Purple",
    "description": "Стильний і компактний плеєр стане незамінним супутником будь-якого меломана. Металевий корпус, яскраві кольори, зручна кліпса для кріплення на одяг або сумку, все це робить дану річ прекрасним подарунком для близьких і себе коханого."
  },
  {
    "id": 15265768,
    "title": "Logitech G213 Prodigy",
    "price": 1699,
    "rating": 4.1,
    "category": "keyboard",
    "thumbnail": "https://s.ek.ua/jpg_zoom1/951449.jpg",
    "color": "Black",
    "description": "Ігрова клавіатура, яка насамперед відрізняється повноцінної RGB-підсвічуванням і плавним ходом клавіш. Logitech G213 Prodigy має повнорозмірну конструкцію, кнопковий блок включає 8 додаткових клавіш, призначених для контролю мультимедіа. Клавіші отримали мембранне пристрій. Зовні кнопки ідентичні за видом з механічними аналогами. Символи розкладки висічені за допомогою лазерного гравіювання."
  }
]
